### Exercise

In exercise folder (same level as this notebook on github) there is **hiring.csv**. This file contains hiring statics for a firm such as experience of candidate, his written test score and personal interview score. Based on these 3 factors, HR will decide the salary. Given this data, you need to build a machine learning model for HR department that can help them decide salaries for future candidates. Using this predict salaries for following candidates,


**2 yr experience, 9 test score, 6 interview score**

**12 yr experience, 10 test score, 10 interview score**

In [4]:
import pandas as pd 
from sklearn.linear_model import LinearRegression

In [8]:
data = pd.read_csv("Exercise/hiring.csv") # go the the Exercise folder
data

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [13]:
data[data.columns[1]].fillna(data[data.columns[1]].min(),inplace = True)
data

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    6.0                           7      72000
7     eleven                    7.0                           8      80000

In [21]:
data.fillna('zero',inplace = True)
data

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    6.0                           7      72000
7     eleven                    7.0                           8      80000

In [24]:
from word2number import w2n
data.experience = data.experience.apply(w2n.word_to_num)
data

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    6.0                           7      72000
7          11                    7.0                           8      80000

In [30]:
x = data.drop(data.columns[-1],axis=1)
y = data['salary($)']

In [26]:
x

   experience  test_score(out of 10)  interview_score(out of 10)
0           0                    8.0                           9
1           0                    8.0                           6
2           5                    6.0                           7
3           2                   10.0                          10
4           7                    9.0                           6
5           3                    7.0                          10
6          10                    6.0                           7
7          11                    7.0                           8

In [31]:
y

0    50000
1    45000
2    60000
3    65000
4    70000
5    62000
6    72000
7    80000
Name: salary($), dtype: int64

In [33]:
model = LinearRegression()
model.fit(x,y)

LinearRegression()

In [34]:
model.predict([[2,9,6]])

array([53922.45707556])

In [35]:
model.predict([[12,10,10]])

array([94857.62102523])

In [36]:
model.score(x,y)

0.9870378236845745

In [37]:
# one-way 
model = LinearRegression().fit(data.drop(data.columns[-1],axis =1),data['salary($)'])

### Answers

* 53713.86
* 93747.79

**the answers do not devaite so much from the predicted values**